DELETE FROM course_grade;
DELETE FROM course;
DELETE FROM student;

INSERT INTO student (sn, no, name)  VALUES
    (101, 'S18180223',  '马心悦'),
    (102, 'S18180224',  '石欣欣'), 
    (103, 'S18180226',  '王欣');

INSERT INTO course (sn, term, no, name, place, time)  VALUES 
    (101,'2020秋季学期', 'C01',  '决策方法与应用','第一公教C309','周一第二大节'), 
    (102,'2020秋季学期', 'C02',  '信息系统开发','第一公教B209','周二第一大节'),
    (103,'2020秋季学期', 'C02',  '信息系统开发','第一公教B209','周五第四大节'),
    (104,'2020秋季学期', 'C03',  'Java程序设计','第一公教B309','周三第二大节'),
    (105,'2020秋季学期', 'C03',  'Java程序设计','第一公教B309','周四第二大节'),
    (106,'2020秋季学期', 'C04',  '信息资源管理','第一公教A111','周三第三大节'),
    (107,'2020秋季学期', 'C05',  '系统工程','第一公教B305','周五第二大节');



INSERT INTO course_grade (stu_sn, cou_sn,term,grade)  VALUES 
    (101, 101,'2020秋季学期',  91), 
    (102, 102,'2020秋季学期', 89),
    (103, 103,'2020秋季学期',  90),
    (104, 104,'2020秋季学期',  89);


INSERT INTO course_sel (stu_sn,cou_sn,term,course_name,time)  VALUES 
    (101, 101,'2020秋季学期','信息管理精要','周一第二大节'), 
    (102, 102,'2020秋季学期','企业资源计划','周二第一大节'),
    (103, 104,'2020秋季学期','就业指导','周五第四大节');
  
    

    